LEXICON = {
    "ru": {
        "start": "В какой стране ты будешь работать?",
        "chosen": "Выбери язык бота / Choose bot language",
    },
    "az": {
        "start": "Hansı ölkədə işləyəcəksiniz?",
        "chosen": "Dil seçin",
    },
    "uz": {
        "start": "Qaysi mamlakatda ishlaysiz?",
        "chosen": "Tilni tanlang",
    },
    "be": {
        "start": "У якой краіне вы будзеце працаваць?",
        "chosen": "Выберыце мову",
    },
    "kk": {
        "start": "Қай елде жұмыс істейсіз?",
        "chosen": "Тілді таңдаңыз",
    },
    "ky": {
        "start": "Кайсы өлкөдө иштейсиз?",
        "chosen": "Тилди тандаңыз",
    },
    "en": {
        "start": "In which country will you work?",
        "chosen": "Choose language",
    }
}

LANG_MAP = {
    "lang_ru": "ru",
    "lang_ky": "ky",
    "lang_uz": "uz",
    "lang_kk": "kk",
    "lang_be": "be",
    "lang_en": "en",
    "lang_az": "az"
}

COUNTRY_MESSAGES = {
    "ru": """Яндекс Еда — удобный онлайн сервис, позволяющий заказать еду из ресторанов и магазинов.

🤝🏼 Мы в поиске курьеров! 
(пеших / авто / велокурьеров)

💵️ Ежедневные выплаты. Высокий доход.
🕒 Вы сами выбираете, когда, где и сколько работать. Чем больше заказов Вы выполняете — тем больше Ваш доход.
📍 Удобные локации в городе на Ваш выбор.
🔥 Постоянные акции и бонусы (за кол-во заказов, доставки в час пик, в выходные и т.д.), которые помогут увеличить доход.
📈 Программа лояльности «Прогресс» для курьеров: чем больше доставок — тем больше бонусов(₽).
💸 Предусмотрена доплата за тяжелые заказы (10-15кг).
♥️ Все чаевые — Ваши.
🛴 Официальные партнеры сервиса, где Вы можете арендовать транспорт (при желании).
🍕 Скидки на заказы в ресторанах-партнерах.
💳 Страхование: в случае травмы или болезни Вам положены выплаты.

🫰🏼 Сейчас — лучшее время, чтобы начать! Не упусти возможность, кол-во мест ограничено!

✅ Заполни короткую анкету и начни получать доход каждый день! 👇🏼""",
    "ky": """Яндекс Еда — ресторандардан жана дүкөндөрдөн тамак-ашка буйрутма берүүгө мүмкүндүк берген ыңгайлуу онлайн кызмат.

🤝🏼 Биз курьерлерди издеп жатабыз!
(жаяу / авто / велокурьерлер)

🔥 Жумалык төлөмдөр. Жогорку киреше.
🕒 Качан, кайда жана канча иштөөнү өзүңүз тандайсыз. Канчалык көп буйрутмаларды аткарсаңыз — кирешеңиз ошончолук жогору болот.
📈 Жогорку суроо-талап үчүн бонустар.
👌🏽 Башкасыз жумуш.
💳 Камсыздандыруу: буйрутмаларды аткаруу учурунда жаракат алсаңыз, сизге компенсация төлөнөт.
📱 Колдонмодо ар дайым колдоо жана жардам жеткиликтүү. 
🙂 Эгер сиз 18 жаштан 65 жашка чейин болсоңуз, ылайыктуу.

🫰🏼 Азыр — баштоо үчүн эң жакшы убакыт! Мүмкүндүктү колдон чыгарбаңыз, орундардын саны чектелүү!

✅ Кыска анкетаны толтуруңуз жана күн сайын киреше таба баштаңыз! 👇🏼""",
    "uz": """Yandex Go Eats — restoranlar, kafelar va doʻkonlardan ovqat buyurtma qilish imkonini beruvchi qulay onlayn xizmat.

🤝🏼 Biz kuryerlarni izlayapmiz!
(piyoda / avto / velokuryerlar)

🔥 Haftalik toʻlovlar. Yuqori daromad: avtomobilda oyiga 10,8 million soʻmgacha, velosipedda 6 million soʻmgacha, piyoda 4,5 million soʻmgacha.
🕒 Siz qachon, qayerda va qancha ishlashni oʻzingiz tanlaysiz. Qancha koʻp buyurtma bajarsangiz — daromadingiz shunchalik yuqori boʻladi.
📈 Yuqori talab uchun bonuslar.
👌🏽 Boshliqsiz ish.
💳 Sugʻurta: buyurtmalarni bajarish vaqtida jarohat olsangiz, sizga kompensatsiya toʻlanadi.
📱 Ilovada har doim qoʻllab-quvvatlash va yordam mavjud. 

🫰🏼 Hozir — boshlash uchun eng yaxshi vaqt! Imkoniyatni qoʻldan boy bermang, joylar soni cheklangan!

✅ Qisqa anketani toʻldiring va har kun daromad olishni boshlang! 👇🏼""",
    "be": """Яндекс Еда — зручны анлайн-сэрвіс, які дазваляе замовіць ежу з рэстаранаў і крам.

🤝🏼 Мы шукаем кур'ераў!
(пешых / аўта / велакур'ераў)

🔥 Штотыднёвыя выплаты. Высокі даход.
🕒 Вы самі выбіраеце, калі, дзе і колькі працаваць. Чым больш заказаў Вы выконваеце — тым больш Ваш даход.
💸 Прадугледжана даплата за цяжкія заказы (10-15кг).
♥️ Усе чаявыя — Вашы.
🛴 Афіцыйныя партнёры сэрвісу, дзе Вы можаце арандаваць транспарт (пры жаданні).
🍕 Зніжкі на заказы ў рэстаранах-партнёрах.
💳 Страхаванне: Вам выплацяць кампенсацыю, калі вы атрымалі траўму падчас выканання заказаў.
🪪 Для афармлення патрэбны пашпарт або ВНЖ.

🫰🏼 Зараз — лепшы час, каб пачаць! Не прапусціце магчымасць, колькасць месцаў абмежавана!

✅ Запоўніце кароткую анкету і пачніце зарабляць ужо сёння! 👇🏼""",
    "kk": """Яндекс Еда — мейрамханалар мен дүкендерден тамаққа тапсырыс беруге мүмкіндік беретін ыңғайлы онлайн сервис.

🤝🏼 Біз курьерлерді іздеп жатырмыз!
(жаяу / авто / велокурьерлер)

🔥 Апталық төлемдер. Жоғары табыс.
🕒 Қашан, қайда және қанша жұмыс істеуді өзіңіз таңдайсыз. Тапсырыстарды неғұрлым көп орындасаңыз — табысыңыз соғұрлым жоғары болады.
👌🏽 Басшысыз жұмыс.
💳 Сақтандыру: тапсырыстарды орындау кезінде жарақат алсаңыз, сізге өтемақы төленеді.
📱 Қолданбада әрқашан қолдау мен көмек қолжетімді. 
🙂 Егер сіз 18-ден 65 жасқа дейін болсаңыз, қолайлы.
🪪 Тіркелу үшін паспорт немесе ВНЖ қажет.

🫰🏼 Қазір — бастау үшін ең жақсы уақыт! Мүмкіндікті жіберіп алмаңыз, орындар саны шектеулі!

✅ Қысқаша сауалнама толтырыңыз және күн сайын табыс таба бастаңыз! 👇🏼""",
"en": """Yandex Eda — a convenient online service that allows you to order food from restaurants and stores.

🤝🏼 We are looking for couriers! 
(on foot / car / bike couriers)

💵️ Daily payments. High income.
🕒 You choose when, where, and how much to work. The more orders you complete, the higher your income.
📍 Convenient locations in the city of your choice.
🔥 Regular promotions and bonuses (for the number of orders, deliveries during rush hour, on weekends, etc.) that help increase income.
📈 Loyalty program “Progress” for couriers: the more deliveries — the more bonuses.
💸 Additional payment for heavy orders (10-15kg).
♥️ All tips are yours.
🛴 Official service partners where you can rent transport (if desired).
🍕 Discounts on orders in partner restaurants.
💳 Insurance: in case of injury or illness, you are entitled to compensation.

🫰🏼 Now is the best time to start! Don’t miss the opportunity, the number of spots is limited!

✅ Fill out a short form and start earning every day! 👇🏼""",

    "az": """Yandex Eda — restoranlardan və mağazalardan yemək sifariş etməyə imkan verən rahat onlayn xidmət.

🤝🏼 Biz kuryerləri axtarırıq!
(piyada / avtomobil / velosiped kuryerləri)

💵️ Həftəlik ödənişlər. Yüksək gəlir.
🕒 Siz işləmək vaxtını, yeri və müddətini özünüz seçirsiniz. Daha çox sifariş yerinə yetirdikcə gəliriniz daha yüksək olur.
📍 Şəhərdə rahat yerlər sizin seçim üçündür.
🔥 Daimi aksiyalar və bonuslar (sifariş sayı, pik saatlarda çatdırılma, həftəsonları və s.) gəlirinizi artırmağa kömək edir.
📈 Kuryerlər üçün “Proqress” sadiqlik proqramı: nə qədər çox çatdırılma — bir o qədər çox bonus.
💸 Ağır sifarişlər üçün əlavə ödəniş nəzərdə tutulub (10-15kq).
♥️ Bütün məsləhətlər sizin üçündür.
🛴 Transport icarəyə götürə biləcəyiniz rəsmi tərəfdaşlar.
🍕 Tərəfdaş restoranlarda endirimlər.
💳 Sığorta: zədə və ya xəstəlik halında ödənişlər sizə ödənilir.

🫰🏼 İndi başlamaq üçün ən yaxşı vaxtdır! Fürsəti əldən verməyin, yerlər məhduddur!

✅ Qısa anketi doldurun və hər gün gəlir əldə etməyə başlayın! 👇🏼"""

}